app/controllers/products_controller.rb

  def store
    session[:section] = 'store'
    @products = Product.paginate :page => params[:page], :per_page => 6, :order => 'title ASC',
      :conditions => {:category => session[:category]}
---
SELECT * FROM "products" WHERE ("products"."category" = E'rodeo') ORDER BY title ASC LIMIT 6 OFFSET 0
SELECT count(*) AS count_all FROM "products" WHERE ("products"."category" = E'rodeos')

  def show
    session[:section] = 'show'
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def edit
    session[:section] = 'edit'
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 2)

  def create
    @product = Product.new(params[:product])
    if params[:alternate] != ''
      @product.category = params[:alternate]
    end

    if @product.save
---
INSERT INTO "products" ("price", "category", "created_at", "photo_file_size", "title", "is_hot", "updated_at", "photo_file_name", "is_showcased", "photo_content_type", "description_short", "photo_updated_at", "description") VALUES(0.0, E'xxx', '2010-01-25 01:31:01.423998', 7214, E'ddfdfs dsf sd', 't', '2010-01-25 01:31:01.423998', E'1620_400.jpg', 'f', E'image/jpeg', E'sd fsd fds fsdfdsf', '2010-01-25 01:30:59.378922', E'sdf dsfdsf sdfsdf') RETURNING "id"

  def update
    @product = Product.find(params[:id])

    if @product.update_attributes(params[:product])
---
SELECT * FROM "products" WHERE ("products"."id" = 4)
UPDATE "products" SET "updated_at" = '2010-01-25 01:32:47.241878', "is_showcased" = 't' WHERE "id" = 3

  def destroy
    session[:section] = 'destroy'
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM "products" WHERE ("products"."id" = 6)
DELETE FROM "products" WHERE "id" = 6